In [1]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [2]:
s= pd.Series([1,3,5,np.nan,6,9])

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [5]:
df

                   A         B         C         D
2013-01-01  0.220101  0.150732  1.379525  0.088802
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516
2013-01-04 -0.440474 -0.222473  0.849896  0.488513
2013-01-05  0.192359  1.277664  1.146643  0.315272
2013-01-06  0.756464 -2.014289  1.072948 -2.265700

In [6]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.192359  1.277664  1.146643  0.315272
2013-01-06  0.756464 -2.014289  1.072948 -2.265700

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.to_numpy()

array([[ 0.22010122,  0.150732  ,  1.37952483,  0.08880187],
       [ 1.53405433,  0.3949445 ,  1.6957615 ,  0.15624145],
       [ 0.82816798, -0.3284558 , -1.00663995, -1.49451643],
       [-0.44047387, -0.22247328,  0.84989632,  0.4885126 ],
       [ 0.19235874,  1.27766412,  1.1466426 ,  0.31527186],
       [ 0.75646393, -2.01428928,  1.07294812, -2.26569973]])

In [12]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.220101    1.534054    0.828168   -0.440474    0.192359    0.756464
B    0.150732    0.394944   -0.328456   -0.222473    1.277664   -2.014289
C    1.379525    1.695761   -1.006640    0.849896    1.146643    1.072948
D    0.088802    0.156241   -1.494516    0.488513    0.315272   -2.265700

In [14]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.756464 -2.014289  1.072948 -2.265700
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516
2013-01-04 -0.440474 -0.222473  0.849896  0.488513
2013-01-01  0.220101  0.150732  1.379525  0.088802
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-05  0.192359  1.277664  1.146643  0.315272

In [15]:
df["A"]

2013-01-01    0.220101
2013-01-02    1.534054
2013-01-03    0.828168
2013-01-04   -0.440474
2013-01-05    0.192359
2013-01-06    0.756464
Freq: D, Name: A, dtype: float64

In [16]:
df[0:1]

                   A         B         C         D
2013-01-01  0.220101  0.150732  1.379525  0.088802

In [17]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.220101  0.150732
2013-01-02  1.534054  0.394944
2013-01-03  0.828168 -0.328456
2013-01-04 -0.440474 -0.222473
2013-01-05  0.192359  1.277664
2013-01-06  0.756464 -2.014289

In [18]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01  0.220101  0.150732  1.379525  0.088802
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516
2013-01-04 -0.440474 -0.222473  0.849896  0.488513
2013-01-05  0.192359  1.277664  1.146643  0.315272
2013-01-06  0.756464 -2.014289  1.072948 -2.265700

Selection by Location of Label

In [21]:
df.loc[dates[0],"A"]

np.float64(0.22010122318230746)

In [22]:
df.at[dates[0],"A"]

np.float64(0.22010122318230746)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [23]:
df.iloc[3]

A   -0.440474
B   -0.222473
C    0.849896
D    0.488513
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.440474 -0.222473
2013-01-05  0.192359  1.277664

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.534054  1.695761
2013-01-03  0.828168 -1.006640
2013-01-05  0.192359  1.146643

In [26]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516

In [27]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.150732  1.379525
2013-01-02  0.394944  1.695761
2013-01-03 -0.328456 -1.006640
2013-01-04 -0.222473  0.849896
2013-01-05  1.277664  1.146643
2013-01-06 -2.014289  1.072948

In [28]:
df.iloc[1,1]

np.float64(0.3949444971084002)

In [29]:
df

                   A         B         C         D
2013-01-01  0.220101  0.150732  1.379525  0.088802
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516
2013-01-04 -0.440474 -0.222473  0.849896  0.488513
2013-01-05  0.192359  1.277664  1.146643  0.315272
2013-01-06  0.756464 -2.014289  1.072948 -2.265700

Boolean Indexing

In [30]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.220101  0.150732  1.379525  0.088802
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516
2013-01-05  0.192359  1.277664  1.146643  0.315272
2013-01-06  0.756464 -2.014289  1.072948 -2.265700

In [31]:
df[df>0]

                   A         B         C         D
2013-01-01  0.220101  0.150732  1.379525  0.088802
2013-01-02  1.534054  0.394944  1.695761  0.156241
2013-01-03  0.828168       NaN       NaN       NaN
2013-01-04       NaN       NaN  0.849896  0.488513
2013-01-05  0.192359  1.277664  1.146643  0.315272
2013-01-06  0.756464       NaN  1.072948       NaN

In [32]:
df2 = df.copy()

In [33]:
df2["E"] = ["one","one","two","three","four","three"]

In [34]:
df2

                   A         B         C         D      E
2013-01-01  0.220101  0.150732  1.379525  0.088802    one
2013-01-02  1.534054  0.394944  1.695761  0.156241    one
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516    two
2013-01-04 -0.440474 -0.222473  0.849896  0.488513  three
2013-01-05  0.192359  1.277664  1.146643  0.315272   four
2013-01-06  0.756464 -2.014289  1.072948 -2.265700  three

Setting

In [35]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [36]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df["F"]=s1

In [38]:
df.at[dates[0],"A"]=0

In [39]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [40]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.379525  0.088802  NaN
2013-01-02  1.534054  0.394944  1.695761  0.156241  1.0
2013-01-03  0.828168 -0.328456 -1.006640 -1.494516  2.0
2013-01-04 -0.440474 -0.222473  0.849896  0.488513  3.0
2013-01-05  0.192359  1.277664  1.146643  0.315272  4.0
2013-01-06  0.756464 -2.014289  1.072948 -2.265700  5.0

In [41]:
df.loc[:,"D"]=np.array([5]*len(df))

In [42]:
len(df)

6

In [43]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0
2013-01-05  0.192359  1.277664  1.146643  5.0  4.0
2013-01-06  0.756464 -2.014289  1.072948  5.0  5.0

In [44]:
df2 = df.copy()

In [45]:
df2[df2>0]= -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.379525 -5.0  NaN
2013-01-02 -1.534054 -0.394944 -1.695761 -5.0 -1.0
2013-01-03 -0.828168 -0.328456 -1.006640 -5.0 -2.0
2013-01-04 -0.440474 -0.222473 -0.849896 -5.0 -3.0
2013-01-05 -0.192359 -1.277664 -1.146643 -5.0 -4.0
2013-01-06 -0.756464 -2.014289 -1.072948 -5.0 -5.0

Missing Data

In [46]:
df1 = df.reindex(index=dates[0:4], columns =list(df.columns)+["E"])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN NaN
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0 NaN
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0 NaN
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0 NaN

In [47]:
df1.loc[dates[0]: dates[1],"E"]=1

In [48]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN  1.0
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0  NaN
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0  NaN

Drop Missing Values

In [49]:
df1.dropna(how="any", axis=1)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN  1.0
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0  NaN
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0  NaN

In [50]:
p=df1.dropna(how="all", axis=1)

In [51]:
p

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN  1.0
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0  NaN
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0  NaN

In [52]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0
2013-01-05  0.192359  1.277664  1.146643  5.0  4.0
2013-01-06  0.756464 -2.014289  1.072948  5.0  5.0

In [53]:
df3 = df.copy()

In [54]:
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0
2013-01-05  0.192359  1.277664  1.146643  5.0  4.0
2013-01-06  0.756464 -2.014289  1.072948  5.0  5.0

While using df.dropna function ,,, axis= 0 to remove row , 1 to remove column ... how="any" removes row/column if there is any missing value in the row/column .............. how = "all" removes the row./column only if all the value in the row or column are NaN

In [55]:
df5 = df3.dropna(axis=1, how="any")
df5

                   A         B         C    D
2013-01-01  0.000000  0.000000  1.379525  5.0
2013-01-02  1.534054  0.394944  1.695761  5.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0
2013-01-04 -0.440474 -0.222473  0.849896  5.0
2013-01-05  0.192359  1.277664  1.146643  5.0
2013-01-06  0.756464 -2.014289  1.072948  5.0

Operations

In [56]:
df.rename(columns={"F":"E"},inplace=True)
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0
2013-01-05  0.192359  1.277664  1.146643  5.0  4.0
2013-01-06  0.756464 -2.014289  1.072948  5.0  5.0

In [57]:
df.mean()

A    0.478429
B   -0.148768
C    0.856356
D    5.000000
E    3.000000
dtype: float64

In [58]:
df.mean(axis=0)

A    0.478429
B   -0.148768
C    0.856356
D    5.000000
E    3.000000
dtype: float64

In [59]:
df.mean(axis=1)

2013-01-01    1.594881
2013-01-02    1.924952
2013-01-03    1.298614
2013-01-04    1.637390
2013-01-05    2.323333
2013-01-06    1.963025
Freq: D, dtype: float64

In [60]:
s= pd.Series([1,2,5,np.nan,6,8],index=dates).shift(2)

In [61]:
df,s

(                   A         B         C    D    E
 2013-01-01  0.000000  0.000000  1.379525  5.0  NaN
 2013-01-02  1.534054  0.394944  1.695761  5.0  1.0
 2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0
 2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0
 2013-01-05  0.192359  1.277664  1.146643  5.0  4.0
 2013-01-06  0.756464 -2.014289  1.072948  5.0  5.0,
 2013-01-01    NaN
 2013-01-02    NaN
 2013-01-03    1.0
 2013-01-04    2.0
 2013-01-05    5.0
 2013-01-06    NaN
 Freq: D, dtype: float64)

In [62]:
df.sub(s,axis="index")

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.171832 -1.328456 -2.006640  4.0  1.0
2013-01-04 -2.440474 -2.222473 -1.150104  3.0  1.0
2013-01-05 -4.807641 -3.722336 -3.853357  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

User Defined Functions

.agg() is used to perform a column wise operation in the dataframe,, where each column as pandas series is operated.. to operate in row, we can use axis=1

In [63]:
df.agg(lambda x: np.mean(x)*2)

A     0.956857
B    -0.297537
C     1.712711
D    10.000000
E     6.000000
dtype: float64

In [64]:
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  1.379525  5.0  NaN
2013-01-02  1.534054  0.394944  1.695761  5.0  1.0
2013-01-03  0.828168 -0.328456 -1.006640  5.0  2.0
2013-01-04 -0.440474 -0.222473  0.849896  5.0  3.0
2013-01-05  0.192359  1.277664  1.146643  5.0  4.0
2013-01-06  0.756464 -2.014289  1.072948  5.0  5.0

df.transform() applies a function to each element preserving the shape of the dataframe

In [65]:
df.transform(lambda x:x*100)

                     A           B           C      D      E
2013-01-01    0.000000    0.000000  137.952483  500.0    NaN
2013-01-02  153.405433   39.494450  169.576150  500.0  100.0
2013-01-03   82.816798  -32.845580 -100.663995  500.0  200.0
2013-01-04  -44.047387  -22.247328   84.989632  500.0  300.0
2013-01-05   19.235874  127.766412  114.664260  500.0  400.0
2013-01-06   75.646393 -201.428928  107.294812  500.0  500.0

Value Counts

In [66]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    4
1    2
2    2
3    1
4    5
5    5
6    1
7    5
8    5
9    4
dtype: int32

In [67]:
s.value_counts()

5    4
4    2
2    2
1    2
Name: count, dtype: int64

String Methods

In [68]:
s=pd.Series(["A","B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])

In [69]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [70]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [71]:
df = pd.DataFrame(np.random.randn(10,4))

In [72]:
df

          0         1         2         3
0  0.960679  0.450515  0.063722  0.203134
1 -0.198915 -0.915064  0.638275  0.477332
2 -0.780362  0.743482 -2.058930 -0.297026
3  0.553200 -0.258065  0.376730 -0.359717
4 -0.765066  2.159401 -1.111088 -0.102450
5 -0.793405 -2.088760 -0.043077  0.969248
6 -0.062420 -1.771505 -1.582912 -1.000595
7 -0.694012  0.231233 -0.286787 -0.109094
8 -0.712232 -0.353897 -0.462028  0.174180
9  0.300201 -1.869308 -0.122321  0.867504

Breaking into Pieces

In [73]:
pieces = [df[:3],df[3:7],df[7:]]

In [74]:
pieces

[          0         1         2         3
 0  0.960679  0.450515  0.063722  0.203134
 1 -0.198915 -0.915064  0.638275  0.477332
 2 -0.780362  0.743482 -2.058930 -0.297026,
           0         1         2         3
 3  0.553200 -0.258065  0.376730 -0.359717
 4 -0.765066  2.159401 -1.111088 -0.102450
 5 -0.793405 -2.088760 -0.043077  0.969248
 6 -0.062420 -1.771505 -1.582912 -1.000595,
           0         1         2         3
 7 -0.694012  0.231233 -0.286787 -0.109094
 8 -0.712232 -0.353897 -0.462028  0.174180
 9  0.300201 -1.869308 -0.122321  0.867504]

In [75]:
pd.concat(pieces)

          0         1         2         3
0  0.960679  0.450515  0.063722  0.203134
1 -0.198915 -0.915064  0.638275  0.477332
2 -0.780362  0.743482 -2.058930 -0.297026
3  0.553200 -0.258065  0.376730 -0.359717
4 -0.765066  2.159401 -1.111088 -0.102450
5 -0.793405 -2.088760 -0.043077  0.969248
6 -0.062420 -1.771505 -1.582912 -1.000595
7 -0.694012  0.231233 -0.286787 -0.109094
8 -0.712232 -0.353897 -0.462028  0.174180
9  0.300201 -1.869308 -0.122321  0.867504

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=records%20to%20it.-,Join,-%23

Join

In [76]:
left = pd.DataFrame({"key":["foo","foo"],"Ival":[1,2]})
left

   key  Ival
0  foo     1
1  foo     2

In [77]:
right = pd.DataFrame({"key":["foo","foo"],"rval":[4,5]})
right

   key  rval
0  foo     4
1  foo     5

In [78]:
pd.merge(left,right,on="key")

   key  Ival  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [79]:
left = pd.DataFrame({"key":["foo","zoo"],"Ival":[1,2]})
right = pd.DataFrame({"key":["foo","zoo"],"Jval":[4,5]})
pd.merge(left,right,on="key")

   key  Ival  Jval
0  foo     1     4
1  zoo     2     5

Grouping

In [80]:
df = pd.DataFrame(
    {
        "A":["foo","bar","foo","bar","foo","bar","foo","bar"],
        "B":["one","one","two","three","two","two","one","one"],
        "C":np.random.randn(8),
        "D":np.random.randn(8)
    }
)

In [81]:
df

     A      B         C         D
0  foo    one  0.493557  0.255369
1  bar    one -1.277405 -1.764886
2  foo    two -0.571671 -0.155672
3  bar  three -1.040130  0.483979
4  foo    two  0.354011 -1.396505
5  bar    two  0.247005  0.470568
6  foo    one  0.450914 -0.215297
7  bar    one  0.463587  1.900030

[2082/05/07 09:55 PM](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=a%20column%20label%2C%20selecting)

In [82]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar -1.606943  1.089690
foo  0.726811 -1.512104

2081/05/08    08:09 PM ...... August 24, 2025

In [83]:
df.groupby("A")[["C"]].sum()

            C
A
bar -1.606943
foo  0.726811

In [84]:
df.groupby("B").sum()

                  A         C         D
B
one    foobarfoobar  0.130653  0.175216
three           bar -1.040130  0.483979
two       foofoobar  0.029345 -1.081608

2082/05/13  08:10 PM, @ Tinkune

In [85]:
df

     A      B         C         D
0  foo    one  0.493557  0.255369
1  bar    one -1.277405 -1.764886
2  foo    two -0.571671 -0.155672
3  bar  three -1.040130  0.483979
4  foo    two  0.354011 -1.396505
5  bar    two  0.247005  0.470568
6  foo    one  0.450914 -0.215297
7  bar    one  0.463587  1.900030

In [90]:
df.groupby(["A"]).sum()

                  B         C         D
A
bar  onethreetwoone -1.606943  1.089690
foo    onetwotwoone  0.726811 -1.512104

Reshaping

In [91]:
arrays = [["bar","bar","baz","baz","foo","foo","qux","qux"],
["one","two","one","two","one","two","one","two"]]

In [ ]:
index = pd.MultiIndex.from_arrays(arrays, names=["first","second"])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])

In [95]:
df

                     A         B
first second
bar   one    -0.627727 -0.025209
      two     0.973487  1.270862
baz   one    -0.649522 -0.069409
      two     0.167069  1.702877
foo   one     0.895077 -0.742395
      two    -0.597877  0.550350
qux   one    -2.168445 -0.317033
      two    -0.011744 -1.305133

In [96]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.627727 -0.025209
      two     0.973487  1.270862
baz   one    -0.649522 -0.069409
      two     0.167069  1.702877

In pandas, df.stack() is used to pivot (or stack) the columns of a DataFrame into the row index, essentially reshaping the data from a wide format to a long format.

In [97]:
stacked = df2.stack(future_stack = True)
stacked

first  second
bar    one     A   -0.627727
               B   -0.025209
       two     A    0.973487
               B    1.270862
baz    one     A   -0.649522
               B   -0.069409
       two     A    0.167069
               B    1.702877
dtype: float64

[Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=B%20%2D0.693205%20%201.591431-,Pivot%20tables,-%23)

In [101]:
df = pd.DataFrame(
    {
        "A":["one","one","two","three"] * 3,
        "B":["A","B","C"]*4,
        "C":["foo","foo","foo","bar","bar","bar"]*2,
        "D":np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [102]:
df

        A  B    C         D         E
0     one  A  foo  0.300616 -0.773265
1     one  B  foo -1.183502  0.862736
2     two  C  foo  0.777334 -0.989997
3   three  A  bar -2.308813  0.257169
4     one  B  bar  0.742647  1.397254
5     one  C  bar  0.815882  1.429620
6     two  A  foo -1.526418  0.958310
7   three  B  foo  0.062483  1.386251
8     one  C  foo  0.341276 -0.274382
9     one  A  bar  0.823422 -0.341162
10    two  B  bar -0.821671  0.208426
11  three  C  bar  0.320773 -1.808708